dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
# NiusBurner mcs51 boards.
#
# Copyright 2026 dunknowcoding (NiusRobotLab)
# SPDX-License-Identifier: Apache-2.0
#
# Generated from niusburner/boards.json by `python -m niusburner setup`.
# Edit the catalog, not this file.
#
# Defaults are the safe answer, not the fastest one: Size, because
# these parts run out of room long before cycles;
# because symbols cost build time and disk rather than flash; and
# auto-detection, because a compiler is normally where its own
# installer put it.

menu.optimize=Optimize
menu.reset=Power switch
menu.entry=Bootloader entry
menu.compiler=Compiler
menu.fcpu=Clock

# ----------------------------------------------------------------------
# 2 KB flash. No ISP: 12 V parallel programmer on a Nano. compile works; upload is not yet wired. No Timer 2, so Serial tops out at 57600 rather than 115200.
at89c2051.name=AT89 series - AT89C2051 (2 KB, compile only) [experimental]
at89c2051.upload.tool=niusburner
at89c2051.upload.protocol=nano_at89c2051
at89c2051.upload.maximum_size=2048
at89c2051.upload.maximum_data_size=128
at89c2051.upload.require_upload_port=false
at89c2051.build.mcu=at89c2051
at89c2051.build.f_cpu=11059200L
at89c2051.build.board=AT89C2051
at89c2051.build.core=niusburner
at89c2051.build.variant=standard
at89c2051.build.nb_board=at89c2051
at89c2051.build.extra_flags=

at89c2051.menu.optimize.size=Size (default)
at89c2051.menu.optimize.size.build.nb_optimize=size
at89c2051.menu.optimize.speed=Speed
at89c2051.menu.optimize.speed.build.nb_optimize=speed
at89c2051.menu.optimize.none=None
at89c2051.menu.optimize.none.build.nb_optimize=none

at89c2051.menu.compiler.auto=Auto-detect SDCC (default)
at89c2051.menu.compiler.auto.build.nb_compiler=auto
at89c2051.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89c2051.menu.compiler.configured.build.nb_compiler=configured

at89c2051.menu.fcpu.board=As the board says (default)
at89c2051.menu.fcpu.board.build.nb_fcpu=board
at89c2051.menu.fcpu.4000000=4 MHz
at89c2051.menu.fcpu.4000000.build.nb_fcpu=4000000
at89c2051.menu.fcpu.8000000=8 MHz
at89c2051.menu.fcpu.8000000.build.nb_fcpu=8000000
at89c2051.menu.fcpu.11059200=11.0592 MHz
at89c2051.menu.fcpu.11059200.build.nb_fcpu=11059200
at89c2051.menu.fcpu.12000000=12 MHz
at89c2051.menu.fcpu.12000000.build.nb_fcpu=12000000
at89c2051.menu.fcpu.16000000=16 MHz
at89c2051.menu.fcpu.16000000.build.nb_fcpu=16000000
at89c2051.menu.fcpu.20000000=20 MHz
at89c2051.menu.fcpu.20000000.build.nb_fcpu=20000000
at89c2051.menu.fcpu.22118400=22.1184 MHz
at89c2051.menu.fcpu.22118400.build.nb_fcpu=22118400
at89c2051.menu.fcpu.24000000=24 MHz
at89c2051.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 4 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it. No Timer 2, so Serial tops out at 57600 rather than 115200.
at89c51.name=AT89 series - AT89C51 (4 KB, compile only) [experimental]
at89c51.upload.tool=niusburner
at89c51.upload.protocol=parallel_hv
at89c51.upload.maximum_size=4096
at89c51.upload.maximum_data_size=128
at89c51.upload.require_upload_port=false
at89c51.build.mcu=at89c51
at89c51.build.f_cpu=11059200L
at89c51.build.board=AT89C51
at89c51.build.core=niusburner
at89c51.build.variant=standard
at89c51.build.nb_board=at89c51
at89c51.build.extra_flags=

at89c51.menu.optimize.size=Size (default)
at89c51.menu.optimize.size.build.nb_optimize=size
at89c51.menu.optimize.speed=Speed
at89c51.menu.optimize.speed.build.nb_optimize=speed
at89c51.menu.optimize.none=None
at89c51.menu.optimize.none.build.nb_optimize=none

at89c51.menu.compiler.auto=Auto-detect SDCC (default)
at89c51.menu.compiler.auto.build.nb_compiler=auto
at89c51.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89c51.menu.compiler.configured.build.nb_compiler=configured

at89c51.menu.fcpu.board=As the board says (default)
at89c51.menu.fcpu.board.build.nb_fcpu=board
at89c51.menu.fcpu.4000000=4 MHz
at89c51.menu.fcpu.4000000.build.nb_fcpu=4000000
at89c51.menu.fcpu.8000000=8 MHz
at89c51.menu.fcpu.8000000.build.nb_fcpu=8000000
at89c51.menu.fcpu.11059200=11.0592 MHz
at89c51.menu.fcpu.11059200.build.nb_fcpu=11059200
at89c51.menu.fcpu.12000000=12 MHz
at89c51.menu.fcpu.12000000.build.nb_fcpu=12000000
at89c51.menu.fcpu.16000000=16 MHz
at89c51.menu.fcpu.16000000.build.nb_fcpu=16000000
at89c51.menu.fcpu.20000000=20 MHz
at89c51.menu.fcpu.20000000.build.nb_fcpu=20000000
at89c51.menu.fcpu.22118400=22.1184 MHz
at89c51.menu.fcpu.22118400.build.nb_fcpu=22118400
at89c51.menu.fcpu.24000000=24 MHz
at89c51.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 8 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
at89c52.name=AT89 series - AT89C52 (8 KB, compile only) [experimental]
at89c52.upload.tool=niusburner
at89c52.upload.protocol=parallel_hv
at89c52.upload.maximum_size=8192
at89c52.upload.maximum_data_size=256
at89c52.upload.require_upload_port=false
at89c52.build.mcu=at89c52
at89c52.build.f_cpu=11059200L
at89c52.build.board=AT89C52
at89c52.build.core=niusburner
at89c52.build.variant=standard
at89c52.build.nb_board=at89c52
at89c52.build.extra_flags=

at89c52.menu.optimize.size=Size (default)
at89c52.menu.optimize.size.build.nb_optimize=size
at89c52.menu.optimize.speed=Speed
at89c52.menu.optimize.speed.build.nb_optimize=speed
at89c52.menu.optimize.none=None
at89c52.menu.optimize.none.build.nb_optimize=none

at89c52.menu.compiler.auto=Auto-detect SDCC (default)
at89c52.menu.compiler.auto.build.nb_compiler=auto
at89c52.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89c52.menu.compiler.configured.build.nb_compiler=configured

at89c52.menu.fcpu.board=As the board says (default)
at89c52.menu.fcpu.board.build.nb_fcpu=board
at89c52.menu.fcpu.4000000=4 MHz
at89c52.menu.fcpu.4000000.build.nb_fcpu=4000000
at89c52.menu.fcpu.8000000=8 MHz
at89c52.menu.fcpu.8000000.build.nb_fcpu=8000000
at89c52.menu.fcpu.11059200=11.0592 MHz
at89c52.menu.fcpu.11059200.build.nb_fcpu=11059200
at89c52.menu.fcpu.12000000=12 MHz
at89c52.menu.fcpu.12000000.build.nb_fcpu=12000000
at89c52.menu.fcpu.16000000=16 MHz
at89c52.menu.fcpu.16000000.build.nb_fcpu=16000000
at89c52.menu.fcpu.20000000=20 MHz
at89c52.menu.fcpu.20000000.build.nb_fcpu=20000000
at89c52.menu.fcpu.22118400=22.1184 MHz
at89c52.menu.fcpu.22118400.build.nb_fcpu=22118400
at89c52.menu.fcpu.24000000=24 MHz
at89c52.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 20 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
at89c55.name=AT89 series - AT89C55 (20 KB, compile only) [experimental]
at89c55.upload.tool=niusburner
at89c55.upload.protocol=parallel_hv
at89c55.upload.maximum_size=20480
at89c55.upload.maximum_data_size=256
at89c55.upload.require_upload_port=false
at89c55.build.mcu=at89c55
at89c55.build.f_cpu=11059200L
at89c55.build.board=AT89C55
at89c55.build.core=niusburner
at89c55.build.variant=standard
at89c55.build.nb_board=at89c55
at89c55.build.extra_flags=

