dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
at89c55.menu.optimize.size=Size (default)
at89c55.menu.optimize.size.build.nb_optimize=size
at89c55.menu.optimize.speed=Speed
at89c55.menu.optimize.speed.build.nb_optimize=speed
at89c55.menu.optimize.none=None
at89c55.menu.optimize.none.build.nb_optimize=none

at89c55.menu.compiler.auto=Auto-detect SDCC (default)
at89c55.menu.compiler.auto.build.nb_compiler=auto
at89c55.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89c55.menu.compiler.configured.build.nb_compiler=configured

at89c55.menu.fcpu.board=As the board says (default)
at89c55.menu.fcpu.board.build.nb_fcpu=board
at89c55.menu.fcpu.4000000=4 MHz
at89c55.menu.fcpu.4000000.build.nb_fcpu=4000000
at89c55.menu.fcpu.8000000=8 MHz
at89c55.menu.fcpu.8000000.build.nb_fcpu=8000000
at89c55.menu.fcpu.11059200=11.0592 MHz
at89c55.menu.fcpu.11059200.build.nb_fcpu=11059200
at89c55.menu.fcpu.12000000=12 MHz
at89c55.menu.fcpu.12000000.build.nb_fcpu=12000000
at89c55.menu.fcpu.16000000=16 MHz
at89c55.menu.fcpu.16000000.build.nb_fcpu=16000000
at89c55.menu.fcpu.20000000=20 MHz
at89c55.menu.fcpu.20000000.build.nb_fcpu=20000000
at89c55.menu.fcpu.22118400=22.1184 MHz
at89c55.menu.fcpu.22118400.build.nb_fcpu=22118400
at89c55.menu.fcpu.24000000=24 MHz
at89c55.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 2 KB flash, 20-pin. Serial ISP like the rest of the AT89S family. Only P1 and P3 are bonded out, so most pin numbers address ports this package does not have. No Timer 2, so Serial tops out at 57600 rather than 115200.
at89s2051.name=AT89 series - AT89S2051 (2 KB, USB-ISP) [experimental]
at89s2051.upload.tool=niusburner
at89s2051.upload.protocol=usbisp_hid
at89s2051.upload.maximum_size=2048
at89s2051.upload.maximum_data_size=128
at89s2051.upload.require_upload_port=false
at89s2051.build.mcu=at89s2051
at89s2051.build.f_cpu=11059200L
at89s2051.build.board=AT89S2051
at89s2051.build.core=niusburner
at89s2051.build.variant=standard
at89s2051.build.nb_board=at89s2051
at89s2051.build.extra_flags=

at89s2051.menu.optimize.size=Size (default)
at89s2051.menu.optimize.size.build.nb_optimize=size
at89s2051.menu.optimize.speed=Speed
at89s2051.menu.optimize.speed.build.nb_optimize=speed
at89s2051.menu.optimize.none=None
at89s2051.menu.optimize.none.build.nb_optimize=none

at89s2051.menu.compiler.auto=Auto-detect SDCC (default)
at89s2051.menu.compiler.auto.build.nb_compiler=auto
at89s2051.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s2051.menu.compiler.configured.build.nb_compiler=configured

at89s2051.menu.fcpu.board=As the board says (default)
at89s2051.menu.fcpu.board.build.nb_fcpu=board
at89s2051.menu.fcpu.4000000=4 MHz
at89s2051.menu.fcpu.4000000.build.nb_fcpu=4000000
at89s2051.menu.fcpu.8000000=8 MHz
at89s2051.menu.fcpu.8000000.build.nb_fcpu=8000000
at89s2051.menu.fcpu.11059200=11.0592 MHz
at89s2051.menu.fcpu.11059200.build.nb_fcpu=11059200
at89s2051.menu.fcpu.12000000=12 MHz
at89s2051.menu.fcpu.12000000.build.nb_fcpu=12000000
at89s2051.menu.fcpu.16000000=16 MHz
at89s2051.menu.fcpu.16000000.build.nb_fcpu=16000000
at89s2051.menu.fcpu.20000000=20 MHz
at89s2051.menu.fcpu.20000000.build.nb_fcpu=20000000
at89s2051.menu.fcpu.22118400=22.1184 MHz
at89s2051.menu.fcpu.22118400.build.nb_fcpu=22118400
at89s2051.menu.fcpu.24000000=24 MHz
at89s2051.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 4 KB flash, 20-pin. Serial ISP like the rest of the AT89S family. Only P1 and P3 are bonded out, so most pin numbers address ports this package does not have. No Timer 2, so Serial tops out at 57600 rather than 115200.
at89s4051.name=AT89 series - AT89S4051 (4 KB, USB-ISP) [experimental]
at89s4051.upload.tool=niusburner
at89s4051.upload.protocol=usbisp_hid
at89s4051.upload.maximum_size=4096
at89s4051.upload.maximum_data_size=128
at89s4051.upload.require_upload_port=false
at89s4051.build.mcu=at89s4051
at89s4051.build.f_cpu=11059200L
at89s4051.build.board=AT89S4051
at89s4051.build.core=niusburner
at89s4051.build.variant=standard
at89s4051.build.nb_board=at89s4051
at89s4051.build.extra_flags=

at89s4051.menu.optimize.size=Size (default)
at89s4051.menu.optimize.size.build.nb_optimize=size
at89s4051.menu.optimize.speed=Speed
at89s4051.menu.optimize.speed.build.nb_optimize=speed
at89s4051.menu.optimize.none=None
at89s4051.menu.optimize.none.build.nb_optimize=none

at89s4051.menu.compiler.auto=Auto-detect SDCC (default)
at89s4051.menu.compiler.auto.build.nb_compiler=auto
at89s4051.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s4051.menu.compiler.configured.build.nb_compiler=configured

at89s4051.menu.fcpu.board=As the board says (default)
at89s4051.menu.fcpu.board.build.nb_fcpu=board
at89s4051.menu.fcpu.4000000=4 MHz
at89s4051.menu.fcpu.4000000.build.nb_fcpu=4000000
at89s4051.menu.fcpu.8000000=8 MHz
at89s4051.menu.fcpu.8000000.build.nb_fcpu=8000000
at89s4051.menu.fcpu.11059200=11.0592 MHz
at89s4051.menu.fcpu.11059200.build.nb_fcpu=11059200
at89s4051.menu.fcpu.12000000=12 MHz
at89s4051.menu.fcpu.12000000.build.nb_fcpu=12000000
at89s4051.menu.fcpu.16000000=16 MHz
at89s4051.menu.fcpu.16000000.build.nb_fcpu=16000000
at89s4051.menu.fcpu.20000000=20 MHz
at89s4051.menu.fcpu.20000000.build.nb_fcpu=20000000
at89s4051.menu.fcpu.22118400=22.1184 MHz
at89s4051.menu.fcpu.22118400.build.nb_fcpu=22118400
at89s4051.menu.fcpu.24000000=24 MHz
at89s4051.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 4 KB flash. Same USB-ISP HID route as AT89S52. No Timer 2, so Serial tops out at 57600 rather than 115200.
at89s51.name=AT89 series - AT89S51 (4 KB, USB-ISP)
at89s51.upload.tool=niusburner
at89s51.upload.protocol=usbisp_hid
at89s51.upload.maximum_size=4096
at89s51.upload.maximum_data_size=128
at89s51.upload.require_upload_port=false
at89s51.build.mcu=at89s51
at89s51.build.f_cpu=11059200L
at89s51.build.board=AT89S51
at89s51.build.core=niusburner
at89s51.build.variant=standard
at89s51.build.nb_board=at89s51
at89s51.build.extra_flags=

at89s51.menu.optimize.size=Size (default)
at89s51.menu.optimize.size.build.nb_optimize=size
at89s51.menu.optimize.speed=Speed
at89s51.menu.optimize.speed.build.nb_optimize=speed
at89s51.menu.optimize.none=None
at89s51.menu.optimize.none.build.nb_optimize=none

at89s51.menu.compiler.auto=Auto-detect SDCC (default)
at89s51.menu.compiler.auto.build.nb_compiler=auto
at89s51.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s51.menu.compiler.configured.build.nb_compiler=configured

at89s51.menu.fcpu.board=As the board says (default)
at89s51.menu.fcpu.board.build.nb_fcpu=board
at89s51.menu.fcpu.4000000=4 MHz
at89s51.menu.fcpu.4000000.build.nb_fcpu=4000000
at89s51.menu.fcpu.8000000=8 MHz
at89s51.menu.fcpu.8000000.build.nb_fcpu=8000000
at89s51.menu.fcpu.11059200=11.0592 MHz
at89s51.menu.fcpu.11059200.build.nb_fcpu=11059200
at89s51.menu.fcpu.12000000=12 MHz
at89s51.menu.fcpu.12000000.build.nb_fcpu=12000000
at89s51.menu.fcpu.16000000=16 MHz
at89s51.menu.fcpu.16000000.build.nb_fcpu=16000000
at89s51.menu.fcpu.20000000=20 MHz
at89s51.menu.fcpu.20000000.build.nb_fcpu=20000000
at89s51.menu.fcpu.22118400=22.1184 MHz
at89s51.menu.fcpu.22118400.build.nb_fcpu=22118400
at89s51.menu.fcpu.24000000=24 MHz
at89s51.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 8 KB flash, 256 IRAM, no XRAM on a minimum DIP-40. USB-ISP HID. Segment/TM1637 sketches fit; colour graphics need external SRAM.
at89s52.name=AT89 series - AT89S52 (8 KB, USB-ISP)
at89s52.upload.tool=niusburner
at89s52.upload.protocol=usbisp_hid
at89s52.upload.maximum_size=8192
at89s52.upload.maximum_data_size=256
at89s52.upload.require_upload_port=false
at89s52.build.mcu=at89s52
at89s52.build.f_cpu=11059200L
at89s52.build.board=AT89S52
at89s52.build.core=niusburner
at89s52.build.variant=standard
at89s52.build.nb_board=at89s52
at89s52.build.extra_flags=

at89s52.menu.optimize.size=Size (default)
at89s52.menu.optimize.size.build.nb_optimize=size
at89s52.menu.optimize.speed=Speed
at89s52.menu.optimize.speed.build.nb_optimize=speed
at89s52.menu.optimize.none=None
at89s52.menu.optimize.none.build.nb_optimize=none

at89s52.menu.compiler.auto=Auto-detect SDCC (default)
at89s52.menu.compiler.auto.build.nb_compiler=auto
at89s52.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s52.menu.compiler.configured.build.nb_compiler=configured

