dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
at89s52.menu.fcpu.board=As the board says (default)
at89s52.menu.fcpu.board.build.nb_fcpu=board
at89s52.menu.fcpu.4000000=4 MHz
at89s52.menu.fcpu.4000000.build.nb_fcpu=4000000
at89s52.menu.fcpu.8000000=8 MHz
at89s52.menu.fcpu.8000000.build.nb_fcpu=8000000
at89s52.menu.fcpu.11059200=11.0592 MHz
at89s52.menu.fcpu.11059200.build.nb_fcpu=11059200
at89s52.menu.fcpu.12000000=12 MHz
at89s52.menu.fcpu.12000000.build.nb_fcpu=12000000
at89s52.menu.fcpu.16000000=16 MHz
at89s52.menu.fcpu.16000000.build.nb_fcpu=16000000
at89s52.menu.fcpu.20000000=20 MHz
at89s52.menu.fcpu.20000000.build.nb_fcpu=20000000
at89s52.menu.fcpu.22118400=22.1184 MHz
at89s52.menu.fcpu.22118400.build.nb_fcpu=22118400
at89s52.menu.fcpu.24000000=24 MHz
at89s52.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 12 KB flash. Same USB-ISP HID route and the same serial-ISP protocol as the AT89S52.
at89s53.name=AT89 series - AT89S53 (12 KB, USB-ISP)
at89s53.upload.tool=niusburner
at89s53.upload.protocol=usbisp_hid
at89s53.upload.maximum_size=12288
at89s53.upload.maximum_data_size=256
at89s53.upload.require_upload_port=false
at89s53.build.mcu=at89s53
at89s53.build.f_cpu=11059200L
at89s53.build.board=AT89S53
at89s53.build.core=niusburner
at89s53.build.variant=standard
at89s53.build.nb_board=at89s53
at89s53.build.extra_flags=

at89s53.menu.optimize.size=Size (default)
at89s53.menu.optimize.size.build.nb_optimize=size
at89s53.menu.optimize.speed=Speed
at89s53.menu.optimize.speed.build.nb_optimize=speed
at89s53.menu.optimize.none=None
at89s53.menu.optimize.none.build.nb_optimize=none

at89s53.menu.compiler.auto=Auto-detect SDCC (default)
at89s53.menu.compiler.auto.build.nb_compiler=auto
at89s53.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s53.menu.compiler.configured.build.nb_compiler=configured

at89s53.menu.fcpu.board=As the board says (default)
at89s53.menu.fcpu.board.build.nb_fcpu=board
at89s53.menu.fcpu.4000000=4 MHz
at89s53.menu.fcpu.4000000.build.nb_fcpu=4000000
at89s53.menu.fcpu.8000000=8 MHz
at89s53.menu.fcpu.8000000.build.nb_fcpu=8000000
at89s53.menu.fcpu.11059200=11.0592 MHz
at89s53.menu.fcpu.11059200.build.nb_fcpu=11059200
at89s53.menu.fcpu.12000000=12 MHz
at89s53.menu.fcpu.12000000.build.nb_fcpu=12000000
at89s53.menu.fcpu.16000000=16 MHz
at89s53.menu.fcpu.16000000.build.nb_fcpu=16000000
at89s53.menu.fcpu.20000000=20 MHz
at89s53.menu.fcpu.20000000.build.nb_fcpu=20000000
at89s53.menu.fcpu.22118400=22.1184 MHz
at89s53.menu.fcpu.22118400.build.nb_fcpu=22118400
at89s53.menu.fcpu.24000000=24 MHz
at89s53.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 8 KB flash plus 2 KB EEPROM. Same serial-ISP protocol; the EEPROM is not written by this tool.
at89s8252.name=AT89 series - AT89S8252 (8 KB, USB-ISP) [experimental]
at89s8252.upload.tool=niusburner
at89s8252.upload.protocol=usbisp_hid
at89s8252.upload.maximum_size=8192
at89s8252.upload.maximum_data_size=256
at89s8252.upload.require_upload_port=false
at89s8252.build.mcu=at89s8252
at89s8252.build.f_cpu=11059200L
at89s8252.build.board=AT89S8252
at89s8252.build.core=niusburner
at89s8252.build.variant=standard
at89s8252.build.nb_board=at89s8252
at89s8252.build.extra_flags=

at89s8252.menu.optimize.size=Size (default)
at89s8252.menu.optimize.size.build.nb_optimize=size
at89s8252.menu.optimize.speed=Speed
at89s8252.menu.optimize.speed.build.nb_optimize=speed
at89s8252.menu.optimize.none=None
at89s8252.menu.optimize.none.build.nb_optimize=none

at89s8252.menu.compiler.auto=Auto-detect SDCC (default)
at89s8252.menu.compiler.auto.build.nb_compiler=auto
at89s8252.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s8252.menu.compiler.configured.build.nb_compiler=configured

at89s8252.menu.fcpu.board=As the board says (default)
at89s8252.menu.fcpu.board.build.nb_fcpu=board
at89s8252.menu.fcpu.4000000=4 MHz
at89s8252.menu.fcpu.4000000.build.nb_fcpu=4000000
at89s8252.menu.fcpu.8000000=8 MHz
at89s8252.menu.fcpu.8000000.build.nb_fcpu=8000000
at89s8252.menu.fcpu.11059200=11.0592 MHz
at89s8252.menu.fcpu.11059200.build.nb_fcpu=11059200
at89s8252.menu.fcpu.12000000=12 MHz
at89s8252.menu.fcpu.12000000.build.nb_fcpu=12000000
at89s8252.menu.fcpu.16000000=16 MHz
at89s8252.menu.fcpu.16000000.build.nb_fcpu=16000000
at89s8252.menu.fcpu.20000000=20 MHz
at89s8252.menu.fcpu.20000000.build.nb_fcpu=20000000
at89s8252.menu.fcpu.22118400=22.1184 MHz
at89s8252.menu.fcpu.22118400.build.nb_fcpu=22118400
at89s8252.menu.fcpu.24000000=24 MHz
at89s8252.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 12 KB flash plus 2 KB EEPROM. Same serial-ISP protocol; the EEPROM is not written by this tool. The vendor tables put this part in the page-programmed class; this backend writes a byte at a time.
at89s8253.name=AT89 series - AT89S8253 (12 KB, USB-ISP) [experimental]
at89s8253.upload.tool=niusburner
at89s8253.upload.protocol=usbisp_hid
at89s8253.upload.maximum_size=12288
at89s8253.upload.maximum_data_size=256
at89s8253.upload.require_upload_port=false
at89s8253.build.mcu=at89s8253
at89s8253.build.f_cpu=11059200L
at89s8253.build.board=AT89S8253
at89s8253.build.core=niusburner
at89s8253.build.variant=standard
at89s8253.build.nb_board=at89s8253
at89s8253.build.extra_flags=

at89s8253.menu.optimize.size=Size (default)
at89s8253.menu.optimize.size.build.nb_optimize=size
at89s8253.menu.optimize.speed=Speed
at89s8253.menu.optimize.speed.build.nb_optimize=speed
at89s8253.menu.optimize.none=None
at89s8253.menu.optimize.none.build.nb_optimize=none

at89s8253.menu.compiler.auto=Auto-detect SDCC (default)
at89s8253.menu.compiler.auto.build.nb_compiler=auto
at89s8253.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s8253.menu.compiler.configured.build.nb_compiler=configured

at89s8253.menu.fcpu.board=As the board says (default)
at89s8253.menu.fcpu.board.build.nb_fcpu=board
at89s8253.menu.fcpu.4000000=4 MHz
at89s8253.menu.fcpu.4000000.build.nb_fcpu=4000000
at89s8253.menu.fcpu.8000000=8 MHz
at89s8253.menu.fcpu.8000000.build.nb_fcpu=8000000
at89s8253.menu.fcpu.11059200=11.0592 MHz
at89s8253.menu.fcpu.11059200.build.nb_fcpu=11059200
at89s8253.menu.fcpu.12000000=12 MHz
at89s8253.menu.fcpu.12000000.build.nb_fcpu=12000000
at89s8253.menu.fcpu.16000000=16 MHz
at89s8253.menu.fcpu.16000000.build.nb_fcpu=16000000
at89s8253.menu.fcpu.20000000=20 MHz
at89s8253.menu.fcpu.20000000.build.nb_fcpu=20000000
at89s8253.menu.fcpu.22118400=22.1184 MHz
at89s8253.menu.fcpu.22118400.build.nb_fcpu=22118400
at89s8253.menu.fcpu.24000000=24 MHz
at89s8253.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# SST, 20 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
sst89e54.name=SST89 series - SST89E54 (20 KB, compile only) [experimental]
sst89e54.upload.tool=niusburner
sst89e54.upload.protocol=parallel_hv
sst89e54.upload.maximum_size=20480
sst89e54.upload.maximum_data_size=256
sst89e54.upload.require_upload_port=false
sst89e54.build.mcu=sst89e54
sst89e54.build.f_cpu=11059200L
sst89e54.build.board=SST89E54
sst89e54.build.core=niusburner
sst89e54.build.variant=standard
sst89e54.build.nb_board=sst89e54
sst89e54.build.extra_flags=

sst89e54.menu.optimize.size=Size (default)
sst89e54.menu.optimize.size.build.nb_optimize=size
sst89e54.menu.optimize.speed=Speed
sst89e54.menu.optimize.speed.build.nb_optimize=speed
sst89e54.menu.optimize.none=None
sst89e54.menu.optimize.none.build.nb_optimize=none

sst89e54.menu.compiler.auto=Auto-detect SDCC (default)
sst89e54.menu.compiler.auto.build.nb_compiler=auto
sst89e54.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
sst89e54.menu.compiler.configured.build.nb_compiler=configured

sst89e54.menu.fcpu.board=As the board says (default)
sst89e54.menu.fcpu.board.build.nb_fcpu=board
sst89e54.menu.fcpu.4000000=4 MHz
sst89e54.menu.fcpu.4000000.build.nb_fcpu=4000000
sst89e54.menu.fcpu.8000000=8 MHz
sst89e54.menu.fcpu.8000000.build.nb_fcpu=8000000
sst89e54.menu.fcpu.11059200=11.0592 MHz
sst89e54.menu.fcpu.11059200.build.nb_fcpu=11059200
sst89e54.menu.fcpu.12000000=12 MHz
sst89e54.menu.fcpu.12000000.build.nb_fcpu=12000000
sst89e54.menu.fcpu.16000000=16 MHz
sst89e54.menu.fcpu.16000000.build.nb_fcpu=16000000
sst89e54.menu.fcpu.20000000=20 MHz
sst89e54.menu.fcpu.20000000.build.nb_fcpu=20000000
sst89e54.menu.fcpu.22118400=22.1184 MHz
sst89e54.menu.fcpu.22118400.build.nb_fcpu=22118400
sst89e54.menu.fcpu.24000000=24 MHz
sst89e54.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# SST, 64 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
sst89e564.name=SST89 series - SST89E564 (64 KB, compile only) [experimental]
sst89e564.upload.tool=niusburner
sst89e564.upload.protocol=parallel_hv
sst89e564.upload.maximum_size=65536
sst89e564.upload.maximum_data_size=256
sst89e564.upload.require_upload_port=false
sst89e564.build.mcu=sst89e564
sst89e564.build.f_cpu=11059200L
sst89e564.build.board=SST89E564
sst89e564.build.core=niusburner
sst89e564.build.variant=standard
sst89e564.build.nb_board=sst89e564
sst89e564.build.extra_flags=

sst89e564.menu.optimize.size=Size (default)
sst89e564.menu.optimize.size.build.nb_optimize=size
sst89e564.menu.optimize.speed=Speed
sst89e564.menu.optimize.speed.build.nb_optimize=speed
sst89e564.menu.optimize.none=None
sst89e564.menu.optimize.none.build.nb_optimize=none

sst89e564.menu.compiler.auto=Auto-detect SDCC (default)
sst89e564.menu.compiler.auto.build.nb_compiler=auto
sst89e564.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
sst89e564.menu.compiler.configured.build.nb_compiler=configured

sst89e564.menu.fcpu.board=As the board says (default)
sst89e564.menu.fcpu.board.build.nb_fcpu=board
sst89e564.menu.fcpu.4000000=4 MHz
sst89e564.menu.fcpu.4000000.build.nb_fcpu=4000000
sst89e564.menu.fcpu.8000000=8 MHz
sst89e564.menu.fcpu.8000000.build.nb_fcpu=8000000
sst89e564.menu.fcpu.11059200=11.0592 MHz
sst89e564.menu.fcpu.11059200.build.nb_fcpu=11059200
sst89e564.menu.fcpu.12000000=12 MHz
sst89e564.menu.fcpu.12000000.build.nb_fcpu=12000000
sst89e564.menu.fcpu.16000000=16 MHz
sst89e564.menu.fcpu.16000000.build.nb_fcpu=16000000
sst89e564.menu.fcpu.20000000=20 MHz
sst89e564.menu.fcpu.20000000.build.nb_fcpu=20000000
sst89e564.menu.fcpu.22118400=22.1184 MHz
sst89e564.menu.fcpu.22118400.build.nb_fcpu=22118400
sst89e564.menu.fcpu.24000000=24 MHz
sst89e564.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 60 KB flash, 2 KB SRAM. Same 1T core and bootloader generation. Internal RC oscillator: no crystal, and the frequency is trimmed at download time. Timing constants here are fitted on a 12-clock core and are an estimate until refitted on a 1T part.
stc15f2k60s2.name=STC15 series - STC15F2K60S2 (60 KB, serial bootloader) [experimental]
stc15f2k60s2.upload.tool=niusburner
stc15f2k60s2.upload.protocol=stcgal
stc15f2k60s2.upload.maximum_size=61440
stc15f2k60s2.upload.maximum_data_size=256
stc15f2k60s2.upload.require_upload_port=true
stc15f2k60s2.build.mcu=stc15f2k60s2
stc15f2k60s2.build.f_cpu=11059200L
stc15f2k60s2.build.board=STC15F2K60S2
stc15f2k60s2.build.core=niusburner
stc15f2k60s2.build.variant=standard
stc15f2k60s2.build.nb_board=stc15f2k60s2
stc15f2k60s2.build.extra_flags=

stc15f2k60s2.menu.optimize.size=Size (default)
stc15f2k60s2.menu.optimize.size.build.nb_optimize=size
stc15f2k60s2.menu.optimize.speed=Speed
stc15f2k60s2.menu.optimize.speed.build.nb_optimize=speed
stc15f2k60s2.menu.optimize.none=None
stc15f2k60s2.menu.optimize.none.build.nb_optimize=none

