dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
stc15w408as.menu.fcpu.board=As the board says (default)
stc15w408as.menu.fcpu.board.build.nb_fcpu=board
stc15w408as.menu.fcpu.4000000=4 MHz
stc15w408as.menu.fcpu.4000000.build.nb_fcpu=4000000
stc15w408as.menu.fcpu.8000000=8 MHz
stc15w408as.menu.fcpu.8000000.build.nb_fcpu=8000000
stc15w408as.menu.fcpu.11059200=11.0592 MHz
stc15w408as.menu.fcpu.11059200.build.nb_fcpu=11059200
stc15w408as.menu.fcpu.12000000=12 MHz
stc15w408as.menu.fcpu.12000000.build.nb_fcpu=12000000
stc15w408as.menu.fcpu.16000000=16 MHz
stc15w408as.menu.fcpu.16000000.build.nb_fcpu=16000000
stc15w408as.menu.fcpu.20000000=20 MHz
stc15w408as.menu.fcpu.20000000.build.nb_fcpu=20000000
stc15w408as.menu.fcpu.22118400=22.1184 MHz
stc15w408as.menu.fcpu.22118400.build.nb_fcpu=22118400
stc15w408as.menu.fcpu.24000000=24 MHz
stc15w408as.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 8 KB flash plus 4 KB EEPROM, 1T core, internal RC only. The RC is set at download time and the part ships untrimmed, so f_cpu here is the frequency the programmer asks for: 24 MHz, the preset the bootloader uses when it is told not to trim. At that clock an 8-bit reload carries 9600 to within 0.16% and little else, so a sketch wanting other rates should ask for a different IRC frequency.
stc8h1k08.name=STC8 series - STC8H1K08 (8 KB, serial bootloader) [experimental]
stc8h1k08.upload.tool=niusburner
stc8h1k08.upload.protocol=stcgal
stc8h1k08.upload.maximum_size=8192
stc8h1k08.upload.maximum_data_size=256
stc8h1k08.upload.require_upload_port=true
stc8h1k08.build.mcu=stc8h1k08
stc8h1k08.build.f_cpu=24000000L
stc8h1k08.build.board=STC8H1K08
stc8h1k08.build.core=niusburner
stc8h1k08.build.variant=standard
stc8h1k08.build.nb_board=stc8h1k08
stc8h1k08.build.extra_flags=

stc8h1k08.menu.optimize.size=Size (default)
stc8h1k08.menu.optimize.size.build.nb_optimize=size
stc8h1k08.menu.optimize.speed=Speed
stc8h1k08.menu.optimize.speed.build.nb_optimize=speed
stc8h1k08.menu.optimize.none=None
stc8h1k08.menu.optimize.none.build.nb_optimize=none

stc8h1k08.menu.reset.none=None - interrupt power by hand (default)
stc8h1k08.menu.reset.none.build.nb_reset=none
stc8h1k08.menu.reset.dtr=Adapter DTR switches VDD
stc8h1k08.menu.reset.dtr.build.nb_reset=dtr
stc8h1k08.menu.reset.rts=Adapter RTS switches VDD
stc8h1k08.menu.reset.rts.build.nb_reset=rts

stc8h1k08.menu.entry.none=Interrupt power by hand (default)
stc8h1k08.menu.entry.none.build.nb_entry=none
stc8h1k08.menu.entry.soft=Sketch reboots itself into the bootloader
stc8h1k08.menu.entry.soft.build.nb_entry=soft

stc8h1k08.menu.compiler.auto=Auto-detect SDCC (default)
stc8h1k08.menu.compiler.auto.build.nb_compiler=auto
stc8h1k08.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc8h1k08.menu.compiler.configured.build.nb_compiler=configured

stc8h1k08.menu.fcpu.board=As the board says (default)
stc8h1k08.menu.fcpu.board.build.nb_fcpu=board
stc8h1k08.menu.fcpu.4000000=4 MHz
stc8h1k08.menu.fcpu.4000000.build.nb_fcpu=4000000
stc8h1k08.menu.fcpu.8000000=8 MHz
stc8h1k08.menu.fcpu.8000000.build.nb_fcpu=8000000
stc8h1k08.menu.fcpu.11059200=11.0592 MHz
stc8h1k08.menu.fcpu.11059200.build.nb_fcpu=11059200
stc8h1k08.menu.fcpu.12000000=12 MHz
stc8h1k08.menu.fcpu.12000000.build.nb_fcpu=12000000
stc8h1k08.menu.fcpu.16000000=16 MHz
stc8h1k08.menu.fcpu.16000000.build.nb_fcpu=16000000
stc8h1k08.menu.fcpu.20000000=20 MHz
stc8h1k08.menu.fcpu.20000000.build.nb_fcpu=20000000
stc8h1k08.menu.fcpu.22118400=22.1184 MHz
stc8h1k08.menu.fcpu.22118400.build.nb_fcpu=22118400
stc8h1k08.menu.fcpu.24000000=24 MHz
stc8h1k08.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 4 KB flash. Same UART bootloader as the STC89C52RC.
stc89c51rc.name=STC89 series - STC89C51RC (4 KB, serial bootloader)
stc89c51rc.upload.tool=niusburner
stc89c51rc.upload.protocol=stcgal
stc89c51rc.upload.maximum_size=4096
stc89c51rc.upload.maximum_data_size=256
stc89c51rc.upload.require_upload_port=true
stc89c51rc.build.mcu=stc89c51rc
stc89c51rc.build.f_cpu=11059200L
stc89c51rc.build.board=STC89C51RC
stc89c51rc.build.core=niusburner
stc89c51rc.build.variant=standard
stc89c51rc.build.nb_board=stc89c51rc
stc89c51rc.build.extra_flags=

stc89c51rc.menu.optimize.size=Size (default)
stc89c51rc.menu.optimize.size.build.nb_optimize=size
stc89c51rc.menu.optimize.speed=Speed
stc89c51rc.menu.optimize.speed.build.nb_optimize=speed
stc89c51rc.menu.optimize.none=None
stc89c51rc.menu.optimize.none.build.nb_optimize=none

stc89c51rc.menu.reset.none=None - interrupt power by hand (default)
stc89c51rc.menu.reset.none.build.nb_reset=none
stc89c51rc.menu.reset.dtr=Adapter DTR switches VDD
stc89c51rc.menu.reset.dtr.build.nb_reset=dtr
stc89c51rc.menu.reset.rts=Adapter RTS switches VDD
stc89c51rc.menu.reset.rts.build.nb_reset=rts

stc89c51rc.menu.entry.none=Interrupt power by hand (default)
stc89c51rc.menu.entry.none.build.nb_entry=none
stc89c51rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc89c51rc.menu.entry.soft.build.nb_entry=soft

stc89c51rc.menu.compiler.auto=Auto-detect SDCC (default)
stc89c51rc.menu.compiler.auto.build.nb_compiler=auto
stc89c51rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc89c51rc.menu.compiler.configured.build.nb_compiler=configured

stc89c51rc.menu.fcpu.board=As the board says (default)
stc89c51rc.menu.fcpu.board.build.nb_fcpu=board
stc89c51rc.menu.fcpu.4000000=4 MHz
stc89c51rc.menu.fcpu.4000000.build.nb_fcpu=4000000
stc89c51rc.menu.fcpu.8000000=8 MHz
stc89c51rc.menu.fcpu.8000000.build.nb_fcpu=8000000
stc89c51rc.menu.fcpu.11059200=11.0592 MHz
stc89c51rc.menu.fcpu.11059200.build.nb_fcpu=11059200
stc89c51rc.menu.fcpu.12000000=12 MHz
stc89c51rc.menu.fcpu.12000000.build.nb_fcpu=12000000
stc89c51rc.menu.fcpu.16000000=16 MHz
stc89c51rc.menu.fcpu.16000000.build.nb_fcpu=16000000
stc89c51rc.menu.fcpu.20000000=20 MHz
stc89c51rc.menu.fcpu.20000000.build.nb_fcpu=20000000
stc89c51rc.menu.fcpu.22118400=22.1184 MHz
stc89c51rc.menu.fcpu.22118400.build.nb_fcpu=22118400
stc89c51rc.menu.fcpu.24000000=24 MHz
stc89c51rc.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# UART bootloader (stcgal) on the serial adapter, not the ISP header. Entry is power-on only, so the board needs a supply that can be interrupted. Reports 8 KB code flash and a 12-clock machine cycle, so the AT89S52 timing carries over.
stc89c52rc.name=STC89 series - STC89C52RC (8 KB, serial bootloader)
stc89c52rc.upload.tool=niusburner
stc89c52rc.upload.protocol=stcgal
stc89c52rc.upload.maximum_size=8192
stc89c52rc.upload.maximum_data_size=256
stc89c52rc.upload.require_upload_port=true
stc89c52rc.build.mcu=stc89c52rc
stc89c52rc.build.f_cpu=11059200L
stc89c52rc.build.board=STC89C52RC
stc89c52rc.build.core=niusburner
stc89c52rc.build.variant=standard
stc89c52rc.build.nb_board=stc89c52rc
stc89c52rc.build.extra_flags=

stc89c52rc.menu.optimize.size=Size (default)
stc89c52rc.menu.optimize.size.build.nb_optimize=size
stc89c52rc.menu.optimize.speed=Speed
stc89c52rc.menu.optimize.speed.build.nb_optimize=speed
stc89c52rc.menu.optimize.none=None
stc89c52rc.menu.optimize.none.build.nb_optimize=none

stc89c52rc.menu.reset.none=None - interrupt power by hand (default)
stc89c52rc.menu.reset.none.build.nb_reset=none
stc89c52rc.menu.reset.dtr=Adapter DTR switches VDD
stc89c52rc.menu.reset.dtr.build.nb_reset=dtr
stc89c52rc.menu.reset.rts=Adapter RTS switches VDD
stc89c52rc.menu.reset.rts.build.nb_reset=rts

stc89c52rc.menu.entry.none=Interrupt power by hand (default)
stc89c52rc.menu.entry.none.build.nb_entry=none
stc89c52rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc89c52rc.menu.entry.soft.build.nb_entry=soft

stc89c52rc.menu.compiler.auto=Auto-detect SDCC (default)
stc89c52rc.menu.compiler.auto.build.nb_compiler=auto
stc89c52rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc89c52rc.menu.compiler.configured.build.nb_compiler=configured

stc89c52rc.menu.fcpu.board=As the board says (default)
stc89c52rc.menu.fcpu.board.build.nb_fcpu=board
stc89c52rc.menu.fcpu.4000000=4 MHz
stc89c52rc.menu.fcpu.4000000.build.nb_fcpu=4000000
stc89c52rc.menu.fcpu.8000000=8 MHz
stc89c52rc.menu.fcpu.8000000.build.nb_fcpu=8000000
stc89c52rc.menu.fcpu.11059200=11.0592 MHz
stc89c52rc.menu.fcpu.11059200.build.nb_fcpu=11059200
stc89c52rc.menu.fcpu.12000000=12 MHz
stc89c52rc.menu.fcpu.12000000.build.nb_fcpu=12000000
stc89c52rc.menu.fcpu.16000000=16 MHz
stc89c52rc.menu.fcpu.16000000.build.nb_fcpu=16000000
stc89c52rc.menu.fcpu.20000000=20 MHz
stc89c52rc.menu.fcpu.20000000.build.nb_fcpu=20000000
stc89c52rc.menu.fcpu.22118400=22.1184 MHz
stc89c52rc.menu.fcpu.22118400.build.nb_fcpu=22118400
stc89c52rc.menu.fcpu.24000000=24 MHz
stc89c52rc.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 12 KB flash. Same STC89-generation UART bootloader as the STC89C52RC, entered on power-on.
stc89c53rc.name=STC89 series - STC89C53RC (12 KB, serial bootloader) [experimental]
stc89c53rc.upload.tool=niusburner
stc89c53rc.upload.protocol=stcgal
stc89c53rc.upload.maximum_size=12288
stc89c53rc.upload.maximum_data_size=256
stc89c53rc.upload.require_upload_port=true
stc89c53rc.build.mcu=stc89c53rc
stc89c53rc.build.f_cpu=11059200L
stc89c53rc.build.board=STC89C53RC
stc89c53rc.build.core=niusburner
stc89c53rc.build.variant=standard
stc89c53rc.build.nb_board=stc89c53rc
stc89c53rc.build.extra_flags=

