dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
stc89c53rc.menu.optimize.size=Size (default)
stc89c53rc.menu.optimize.size.build.nb_optimize=size
stc89c53rc.menu.optimize.speed=Speed
stc89c53rc.menu.optimize.speed.build.nb_optimize=speed
stc89c53rc.menu.optimize.none=None
stc89c53rc.menu.optimize.none.build.nb_optimize=none

stc89c53rc.menu.reset.none=None - interrupt power by hand (default)
stc89c53rc.menu.reset.none.build.nb_reset=none
stc89c53rc.menu.reset.dtr=Adapter DTR switches VDD
stc89c53rc.menu.reset.dtr.build.nb_reset=dtr
stc89c53rc.menu.reset.rts=Adapter RTS switches VDD
stc89c53rc.menu.reset.rts.build.nb_reset=rts

stc89c53rc.menu.entry.none=Interrupt power by hand (default)
stc89c53rc.menu.entry.none.build.nb_entry=none
stc89c53rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc89c53rc.menu.entry.soft.build.nb_entry=soft

stc89c53rc.menu.compiler.auto=Auto-detect SDCC (default)
stc89c53rc.menu.compiler.auto.build.nb_compiler=auto
stc89c53rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc89c53rc.menu.compiler.configured.build.nb_compiler=configured

stc89c53rc.menu.fcpu.board=As the board says (default)
stc89c53rc.menu.fcpu.board.build.nb_fcpu=board
stc89c53rc.menu.fcpu.4000000=4 MHz
stc89c53rc.menu.fcpu.4000000.build.nb_fcpu=4000000
stc89c53rc.menu.fcpu.8000000=8 MHz
stc89c53rc.menu.fcpu.8000000.build.nb_fcpu=8000000
stc89c53rc.menu.fcpu.11059200=11.0592 MHz
stc89c53rc.menu.fcpu.11059200.build.nb_fcpu=11059200
stc89c53rc.menu.fcpu.12000000=12 MHz
stc89c53rc.menu.fcpu.12000000.build.nb_fcpu=12000000
stc89c53rc.menu.fcpu.16000000=16 MHz
stc89c53rc.menu.fcpu.16000000.build.nb_fcpu=16000000
stc89c53rc.menu.fcpu.20000000=20 MHz
stc89c53rc.menu.fcpu.20000000.build.nb_fcpu=20000000
stc89c53rc.menu.fcpu.22118400=22.1184 MHz
stc89c53rc.menu.fcpu.22118400.build.nb_fcpu=22118400
stc89c53rc.menu.fcpu.24000000=24 MHz
stc89c53rc.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 16 KB flash. Same STC89-generation UART bootloader as the STC89C52RC, entered on power-on.
stc89c54rd.name=STC89 series - STC89C54RD (16 KB, serial bootloader) [experimental]
stc89c54rd.upload.tool=niusburner
stc89c54rd.upload.protocol=stcgal
stc89c54rd.upload.maximum_size=16384
stc89c54rd.upload.maximum_data_size=256
stc89c54rd.upload.require_upload_port=true
stc89c54rd.build.mcu=stc89c54rd
stc89c54rd.build.f_cpu=11059200L
stc89c54rd.build.board=STC89C54RD
stc89c54rd.build.core=niusburner
stc89c54rd.build.variant=standard
stc89c54rd.build.nb_board=stc89c54rd
stc89c54rd.build.extra_flags=

stc89c54rd.menu.optimize.size=Size (default)
stc89c54rd.menu.optimize.size.build.nb_optimize=size
stc89c54rd.menu.optimize.speed=Speed
stc89c54rd.menu.optimize.speed.build.nb_optimize=speed
stc89c54rd.menu.optimize.none=None
stc89c54rd.menu.optimize.none.build.nb_optimize=none

stc89c54rd.menu.reset.none=None - interrupt power by hand (default)
stc89c54rd.menu.reset.none.build.nb_reset=none
stc89c54rd.menu.reset.dtr=Adapter DTR switches VDD
stc89c54rd.menu.reset.dtr.build.nb_reset=dtr
stc89c54rd.menu.reset.rts=Adapter RTS switches VDD
stc89c54rd.menu.reset.rts.build.nb_reset=rts

stc89c54rd.menu.entry.none=Interrupt power by hand (default)
stc89c54rd.menu.entry.none.build.nb_entry=none
stc89c54rd.menu.entry.soft=Sketch reboots itself into the bootloader
stc89c54rd.menu.entry.soft.build.nb_entry=soft

stc89c54rd.menu.compiler.auto=Auto-detect SDCC (default)
stc89c54rd.menu.compiler.auto.build.nb_compiler=auto
stc89c54rd.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc89c54rd.menu.compiler.configured.build.nb_compiler=configured

stc89c54rd.menu.fcpu.board=As the board says (default)
stc89c54rd.menu.fcpu.board.build.nb_fcpu=board
stc89c54rd.menu.fcpu.4000000=4 MHz
stc89c54rd.menu.fcpu.4000000.build.nb_fcpu=4000000
stc89c54rd.menu.fcpu.8000000=8 MHz
stc89c54rd.menu.fcpu.8000000.build.nb_fcpu=8000000
stc89c54rd.menu.fcpu.11059200=11.0592 MHz
stc89c54rd.menu.fcpu.11059200.build.nb_fcpu=11059200
stc89c54rd.menu.fcpu.12000000=12 MHz
stc89c54rd.menu.fcpu.12000000.build.nb_fcpu=12000000
stc89c54rd.menu.fcpu.16000000=16 MHz
stc89c54rd.menu.fcpu.16000000.build.nb_fcpu=16000000
stc89c54rd.menu.fcpu.20000000=20 MHz
stc89c54rd.menu.fcpu.20000000.build.nb_fcpu=20000000
stc89c54rd.menu.fcpu.22118400=22.1184 MHz
stc89c54rd.menu.fcpu.22118400.build.nb_fcpu=22118400
stc89c54rd.menu.fcpu.24000000=24 MHz
stc89c54rd.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 32 KB flash. Same STC89-generation UART bootloader as the STC89C52RC, entered on power-on.
stc89c58rd.name=STC89 series - STC89C58RD (32 KB, serial bootloader) [experimental]
stc89c58rd.upload.tool=niusburner
stc89c58rd.upload.protocol=stcgal
stc89c58rd.upload.maximum_size=32768
stc89c58rd.upload.maximum_data_size=256
stc89c58rd.upload.require_upload_port=true
stc89c58rd.build.mcu=stc89c58rd
stc89c58rd.build.f_cpu=11059200L
stc89c58rd.build.board=STC89C58RD
stc89c58rd.build.core=niusburner
stc89c58rd.build.variant=standard
stc89c58rd.build.nb_board=stc89c58rd
stc89c58rd.build.extra_flags=

stc89c58rd.menu.optimize.size=Size (default)
stc89c58rd.menu.optimize.size.build.nb_optimize=size
stc89c58rd.menu.optimize.speed=Speed
stc89c58rd.menu.optimize.speed.build.nb_optimize=speed
stc89c58rd.menu.optimize.none=None
stc89c58rd.menu.optimize.none.build.nb_optimize=none

stc89c58rd.menu.reset.none=None - interrupt power by hand (default)
stc89c58rd.menu.reset.none.build.nb_reset=none
stc89c58rd.menu.reset.dtr=Adapter DTR switches VDD
stc89c58rd.menu.reset.dtr.build.nb_reset=dtr
stc89c58rd.menu.reset.rts=Adapter RTS switches VDD
stc89c58rd.menu.reset.rts.build.nb_reset=rts

stc89c58rd.menu.entry.none=Interrupt power by hand (default)
stc89c58rd.menu.entry.none.build.nb_entry=none
stc89c58rd.menu.entry.soft=Sketch reboots itself into the bootloader
stc89c58rd.menu.entry.soft.build.nb_entry=soft

stc89c58rd.menu.compiler.auto=Auto-detect SDCC (default)
stc89c58rd.menu.compiler.auto.build.nb_compiler=auto
stc89c58rd.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc89c58rd.menu.compiler.configured.build.nb_compiler=configured

stc89c58rd.menu.fcpu.board=As the board says (default)
stc89c58rd.menu.fcpu.board.build.nb_fcpu=board
stc89c58rd.menu.fcpu.4000000=4 MHz
stc89c58rd.menu.fcpu.4000000.build.nb_fcpu=4000000
stc89c58rd.menu.fcpu.8000000=8 MHz
stc89c58rd.menu.fcpu.8000000.build.nb_fcpu=8000000
stc89c58rd.menu.fcpu.11059200=11.0592 MHz
stc89c58rd.menu.fcpu.11059200.build.nb_fcpu=11059200
stc89c58rd.menu.fcpu.12000000=12 MHz
stc89c58rd.menu.fcpu.12000000.build.nb_fcpu=12000000
stc89c58rd.menu.fcpu.16000000=16 MHz
stc89c58rd.menu.fcpu.16000000.build.nb_fcpu=16000000
stc89c58rd.menu.fcpu.20000000=20 MHz
stc89c58rd.menu.fcpu.20000000.build.nb_fcpu=20000000
stc89c58rd.menu.fcpu.22118400=22.1184 MHz
stc89c58rd.menu.fcpu.22118400.build.nb_fcpu=22118400
stc89c58rd.menu.fcpu.24000000=24 MHz
stc89c58rd.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 4 KB flash. Same STC89-generation UART bootloader as the STC89C52RC, entered on power-on.
stc90c51rc.name=STC90 series - STC90C51RC (4 KB, serial bootloader) [experimental]
stc90c51rc.upload.tool=niusburner
stc90c51rc.upload.protocol=stcgal
stc90c51rc.upload.maximum_size=4096
stc90c51rc.upload.maximum_data_size=256
stc90c51rc.upload.require_upload_port=true
stc90c51rc.build.mcu=stc90c51rc
stc90c51rc.build.f_cpu=11059200L
stc90c51rc.build.board=STC90C51RC
stc90c51rc.build.core=niusburner
stc90c51rc.build.variant=standard
stc90c51rc.build.nb_board=stc90c51rc
stc90c51rc.build.extra_flags=

stc90c51rc.menu.optimize.size=Size (default)
stc90c51rc.menu.optimize.size.build.nb_optimize=size
stc90c51rc.menu.optimize.speed=Speed
stc90c51rc.menu.optimize.speed.build.nb_optimize=speed
stc90c51rc.menu.optimize.none=None
stc90c51rc.menu.optimize.none.build.nb_optimize=none

stc90c51rc.menu.reset.none=None - interrupt power by hand (default)
stc90c51rc.menu.reset.none.build.nb_reset=none
stc90c51rc.menu.reset.dtr=Adapter DTR switches VDD
stc90c51rc.menu.reset.dtr.build.nb_reset=dtr
stc90c51rc.menu.reset.rts=Adapter RTS switches VDD
stc90c51rc.menu.reset.rts.build.nb_reset=rts

stc90c51rc.menu.entry.none=Interrupt power by hand (default)
stc90c51rc.menu.entry.none.build.nb_entry=none
stc90c51rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc90c51rc.menu.entry.soft.build.nb_entry=soft

stc90c51rc.menu.compiler.auto=Auto-detect SDCC (default)
stc90c51rc.menu.compiler.auto.build.nb_compiler=auto
stc90c51rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc90c51rc.menu.compiler.configured.build.nb_compiler=configured

