dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
stc90c51rc.menu.fcpu.board=As the board says (default)
stc90c51rc.menu.fcpu.board.build.nb_fcpu=board
stc90c51rc.menu.fcpu.4000000=4 MHz
stc90c51rc.menu.fcpu.4000000.build.nb_fcpu=4000000
stc90c51rc.menu.fcpu.8000000=8 MHz
stc90c51rc.menu.fcpu.8000000.build.nb_fcpu=8000000
stc90c51rc.menu.fcpu.11059200=11.0592 MHz
stc90c51rc.menu.fcpu.11059200.build.nb_fcpu=11059200
stc90c51rc.menu.fcpu.12000000=12 MHz
stc90c51rc.menu.fcpu.12000000.build.nb_fcpu=12000000
stc90c51rc.menu.fcpu.16000000=16 MHz
stc90c51rc.menu.fcpu.16000000.build.nb_fcpu=16000000
stc90c51rc.menu.fcpu.20000000=20 MHz
stc90c51rc.menu.fcpu.20000000.build.nb_fcpu=20000000
stc90c51rc.menu.fcpu.22118400=22.1184 MHz
stc90c51rc.menu.fcpu.22118400.build.nb_fcpu=22118400
stc90c51rc.menu.fcpu.24000000=24 MHz
stc90c51rc.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 8 KB flash. Same STC89-generation bootloader.
stc90c52rc.name=STC90 series - STC90C52RC (8 KB, serial bootloader)
stc90c52rc.upload.tool=niusburner
stc90c52rc.upload.protocol=stcgal
stc90c52rc.upload.maximum_size=8192
stc90c52rc.upload.maximum_data_size=256
stc90c52rc.upload.require_upload_port=true
stc90c52rc.build.mcu=stc90c52rc
stc90c52rc.build.f_cpu=11059200L
stc90c52rc.build.board=STC90C52RC
stc90c52rc.build.core=niusburner
stc90c52rc.build.variant=standard
stc90c52rc.build.nb_board=stc90c52rc
stc90c52rc.build.extra_flags=

stc90c52rc.menu.optimize.size=Size (default)
stc90c52rc.menu.optimize.size.build.nb_optimize=size
stc90c52rc.menu.optimize.speed=Speed
stc90c52rc.menu.optimize.speed.build.nb_optimize=speed
stc90c52rc.menu.optimize.none=None
stc90c52rc.menu.optimize.none.build.nb_optimize=none

stc90c52rc.menu.reset.none=None - interrupt power by hand (default)
stc90c52rc.menu.reset.none.build.nb_reset=none
stc90c52rc.menu.reset.dtr=Adapter DTR switches VDD
stc90c52rc.menu.reset.dtr.build.nb_reset=dtr
stc90c52rc.menu.reset.rts=Adapter RTS switches VDD
stc90c52rc.menu.reset.rts.build.nb_reset=rts

stc90c52rc.menu.entry.none=Interrupt power by hand (default)
stc90c52rc.menu.entry.none.build.nb_entry=none
stc90c52rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc90c52rc.menu.entry.soft.build.nb_entry=soft

stc90c52rc.menu.compiler.auto=Auto-detect SDCC (default)
stc90c52rc.menu.compiler.auto.build.nb_compiler=auto
stc90c52rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc90c52rc.menu.compiler.configured.build.nb_compiler=configured

stc90c52rc.menu.fcpu.board=As the board says (default)
stc90c52rc.menu.fcpu.board.build.nb_fcpu=board
stc90c52rc.menu.fcpu.4000000=4 MHz
stc90c52rc.menu.fcpu.4000000.build.nb_fcpu=4000000
stc90c52rc.menu.fcpu.8000000=8 MHz
stc90c52rc.menu.fcpu.8000000.build.nb_fcpu=8000000
stc90c52rc.menu.fcpu.11059200=11.0592 MHz
stc90c52rc.menu.fcpu.11059200.build.nb_fcpu=11059200
stc90c52rc.menu.fcpu.12000000=12 MHz
stc90c52rc.menu.fcpu.12000000.build.nb_fcpu=12000000
stc90c52rc.menu.fcpu.16000000=16 MHz
stc90c52rc.menu.fcpu.16000000.build.nb_fcpu=16000000
stc90c52rc.menu.fcpu.20000000=20 MHz
stc90c52rc.menu.fcpu.20000000.build.nb_fcpu=20000000
stc90c52rc.menu.fcpu.22118400=22.1184 MHz
stc90c52rc.menu.fcpu.22118400.build.nb_fcpu=22118400
stc90c52rc.menu.fcpu.24000000=24 MHz
stc90c52rc.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 32 KB flash. Same STC89-generation UART bootloader as the STC89C52RC, entered on power-on.
stc90c58rd.name=STC90 series - STC90C58RD (32 KB, serial bootloader) [experimental]
stc90c58rd.upload.tool=niusburner
stc90c58rd.upload.protocol=stcgal
stc90c58rd.upload.maximum_size=32768
stc90c58rd.upload.maximum_data_size=256
stc90c58rd.upload.require_upload_port=true
stc90c58rd.build.mcu=stc90c58rd
stc90c58rd.build.f_cpu=11059200L
stc90c58rd.build.board=STC90C58RD
stc90c58rd.build.core=niusburner
stc90c58rd.build.variant=standard
stc90c58rd.build.nb_board=stc90c58rd
stc90c58rd.build.extra_flags=

stc90c58rd.menu.optimize.size=Size (default)
stc90c58rd.menu.optimize.size.build.nb_optimize=size
stc90c58rd.menu.optimize.speed=Speed
stc90c58rd.menu.optimize.speed.build.nb_optimize=speed
stc90c58rd.menu.optimize.none=None
stc90c58rd.menu.optimize.none.build.nb_optimize=none

stc90c58rd.menu.reset.none=None - interrupt power by hand (default)
stc90c58rd.menu.reset.none.build.nb_reset=none
stc90c58rd.menu.reset.dtr=Adapter DTR switches VDD
stc90c58rd.menu.reset.dtr.build.nb_reset=dtr
stc90c58rd.menu.reset.rts=Adapter RTS switches VDD
stc90c58rd.menu.reset.rts.build.nb_reset=rts

stc90c58rd.menu.entry.none=Interrupt power by hand (default)
stc90c58rd.menu.entry.none.build.nb_entry=none
stc90c58rd.menu.entry.soft=Sketch reboots itself into the bootloader
stc90c58rd.menu.entry.soft.build.nb_entry=soft

stc90c58rd.menu.compiler.auto=Auto-detect SDCC (default)
stc90c58rd.menu.compiler.auto.build.nb_compiler=auto
stc90c58rd.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc90c58rd.menu.compiler.configured.build.nb_compiler=configured

stc90c58rd.menu.fcpu.board=As the board says (default)
stc90c58rd.menu.fcpu.board.build.nb_fcpu=board
stc90c58rd.menu.fcpu.4000000=4 MHz
stc90c58rd.menu.fcpu.4000000.build.nb_fcpu=4000000
stc90c58rd.menu.fcpu.8000000=8 MHz
stc90c58rd.menu.fcpu.8000000.build.nb_fcpu=8000000
stc90c58rd.menu.fcpu.11059200=11.0592 MHz
stc90c58rd.menu.fcpu.11059200.build.nb_fcpu=11059200
stc90c58rd.menu.fcpu.12000000=12 MHz
stc90c58rd.menu.fcpu.12000000.build.nb_fcpu=12000000
stc90c58rd.menu.fcpu.16000000=16 MHz
stc90c58rd.menu.fcpu.16000000.build.nb_fcpu=16000000
stc90c58rd.menu.fcpu.20000000=20 MHz
stc90c58rd.menu.fcpu.20000000.build.nb_fcpu=20000000
stc90c58rd.menu.fcpu.22118400=22.1184 MHz
stc90c58rd.menu.fcpu.22118400.build.nb_fcpu=22118400
stc90c58rd.menu.fcpu.24000000=24 MHz
stc90c58rd.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# Winbond, 4 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it. No Timer 2, so Serial tops out at 57600 rather than 115200.
w78e51.name=W78 series - W78E51 (4 KB, compile only) [experimental]
w78e51.upload.tool=niusburner
w78e51.upload.protocol=parallel_hv
w78e51.upload.maximum_size=4096
w78e51.upload.maximum_data_size=128
w78e51.upload.require_upload_port=false
w78e51.build.mcu=w78e51
w78e51.build.f_cpu=11059200L
w78e51.build.board=W78E51
w78e51.build.core=niusburner
w78e51.build.variant=standard
w78e51.build.nb_board=w78e51
w78e51.build.extra_flags=

w78e51.menu.optimize.size=Size (default)
w78e51.menu.optimize.size.build.nb_optimize=size
w78e51.menu.optimize.speed=Speed
w78e51.menu.optimize.speed.build.nb_optimize=speed
w78e51.menu.optimize.none=None
w78e51.menu.optimize.none.build.nb_optimize=none

