dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
w78e51.menu.compiler.auto=Auto-detect SDCC (default)
w78e51.menu.compiler.auto.build.nb_compiler=auto
w78e51.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
w78e51.menu.compiler.configured.build.nb_compiler=configured

w78e51.menu.fcpu.board=As the board says (default)
w78e51.menu.fcpu.board.build.nb_fcpu=board
w78e51.menu.fcpu.4000000=4 MHz
w78e51.menu.fcpu.4000000.build.nb_fcpu=4000000
w78e51.menu.fcpu.8000000=8 MHz
w78e51.menu.fcpu.8000000.build.nb_fcpu=8000000
w78e51.menu.fcpu.11059200=11.0592 MHz
w78e51.menu.fcpu.11059200.build.nb_fcpu=11059200
w78e51.menu.fcpu.12000000=12 MHz
w78e51.menu.fcpu.12000000.build.nb_fcpu=12000000
w78e51.menu.fcpu.16000000=16 MHz
w78e51.menu.fcpu.16000000.build.nb_fcpu=16000000
w78e51.menu.fcpu.20000000=20 MHz
w78e51.menu.fcpu.20000000.build.nb_fcpu=20000000
w78e51.menu.fcpu.22118400=22.1184 MHz
w78e51.menu.fcpu.22118400.build.nb_fcpu=22118400
w78e51.menu.fcpu.24000000=24 MHz
w78e51.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# Winbond, 8 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
w78e52.name=W78 series - W78E52 (8 KB, compile only) [experimental]
w78e52.upload.tool=niusburner
w78e52.upload.protocol=parallel_hv
w78e52.upload.maximum_size=8192
w78e52.upload.maximum_data_size=256
w78e52.upload.require_upload_port=false
w78e52.build.mcu=w78e52
w78e52.build.f_cpu=11059200L
w78e52.build.board=W78E52
w78e52.build.core=niusburner
w78e52.build.variant=standard
w78e52.build.nb_board=w78e52
w78e52.build.extra_flags=

w78e52.menu.optimize.size=Size (default)
w78e52.menu.optimize.size.build.nb_optimize=size
w78e52.menu.optimize.speed=Speed
w78e52.menu.optimize.speed.build.nb_optimize=speed
w78e52.menu.optimize.none=None
w78e52.menu.optimize.none.build.nb_optimize=none

w78e52.menu.compiler.auto=Auto-detect SDCC (default)
w78e52.menu.compiler.auto.build.nb_compiler=auto
w78e52.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
w78e52.menu.compiler.configured.build.nb_compiler=configured

w78e52.menu.fcpu.board=As the board says (default)
w78e52.menu.fcpu.board.build.nb_fcpu=board
w78e52.menu.fcpu.4000000=4 MHz
w78e52.menu.fcpu.4000000.build.nb_fcpu=4000000
w78e52.menu.fcpu.8000000=8 MHz
w78e52.menu.fcpu.8000000.build.nb_fcpu=8000000
w78e52.menu.fcpu.11059200=11.0592 MHz
w78e52.menu.fcpu.11059200.build.nb_fcpu=11059200
w78e52.menu.fcpu.12000000=12 MHz
w78e52.menu.fcpu.12000000.build.nb_fcpu=12000000
w78e52.menu.fcpu.16000000=16 MHz
w78e52.menu.fcpu.16000000.build.nb_fcpu=16000000
w78e52.menu.fcpu.20000000=20 MHz
w78e52.menu.fcpu.20000000.build.nb_fcpu=20000000
w78e52.menu.fcpu.22118400=22.1184 MHz
w78e52.menu.fcpu.22118400.build.nb_fcpu=22118400
w78e52.menu.fcpu.24000000=24 MHz
w78e52.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# Winbond, 16 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
w78e54.name=W78 series - W78E54 (16 KB, compile only) [experimental]
w78e54.upload.tool=niusburner
w78e54.upload.protocol=parallel_hv
w78e54.upload.maximum_size=16384
w78e54.upload.maximum_data_size=256
w78e54.upload.require_upload_port=false
w78e54.build.mcu=w78e54
w78e54.build.f_cpu=11059200L
w78e54.build.board=W78E54
w78e54.build.core=niusburner
w78e54.build.variant=standard
w78e54.build.nb_board=w78e54
w78e54.build.extra_flags=

w78e54.menu.optimize.size=Size (default)
w78e54.menu.optimize.size.build.nb_optimize=size
w78e54.menu.optimize.speed=Speed
w78e54.menu.optimize.speed.build.nb_optimize=speed
w78e54.menu.optimize.none=None
w78e54.menu.optimize.none.build.nb_optimize=none

w78e54.menu.compiler.auto=Auto-detect SDCC (default)
w78e54.menu.compiler.auto.build.nb_compiler=auto
w78e54.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
w78e54.menu.compiler.configured.build.nb_compiler=configured

w78e54.menu.fcpu.board=As the board says (default)
w78e54.menu.fcpu.board.build.nb_fcpu=board
w78e54.menu.fcpu.4000000=4 MHz
w78e54.menu.fcpu.4000000.build.nb_fcpu=4000000
w78e54.menu.fcpu.8000000=8 MHz
w78e54.menu.fcpu.8000000.build.nb_fcpu=8000000
w78e54.menu.fcpu.11059200=11.0592 MHz
w78e54.menu.fcpu.11059200.build.nb_fcpu=11059200
w78e54.menu.fcpu.12000000=12 MHz
w78e54.menu.fcpu.12000000.build.nb_fcpu=12000000
w78e54.menu.fcpu.16000000=16 MHz
w78e54.menu.fcpu.16000000.build.nb_fcpu=16000000
w78e54.menu.fcpu.20000000=20 MHz
w78e54.menu.fcpu.20000000.build.nb_fcpu=20000000
w78e54.menu.fcpu.22118400=22.1184 MHz
w78e54.menu.fcpu.22118400.build.nb_fcpu=22118400
w78e54.menu.fcpu.24000000=24 MHz
w78e54.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# Winbond, 32 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
w78e58.name=W78 series - W78E58 (32 KB, compile only) [experimental]
w78e58.upload.tool=niusburner
w78e58.upload.protocol=parallel_hv
w78e58.upload.maximum_size=32768
w78e58.upload.maximum_data_size=256
w78e58.upload.require_upload_port=false
w78e58.build.mcu=w78e58
w78e58.build.f_cpu=11059200L
w78e58.build.board=W78E58
w78e58.build.core=niusburner
w78e58.build.variant=standard
w78e58.build.nb_board=w78e58
w78e58.build.extra_flags=

w78e58.menu.optimize.size=Size (default)
w78e58.menu.optimize.size.build.nb_optimize=size
w78e58.menu.optimize.speed=Speed
w78e58.menu.optimize.speed.build.nb_optimize=speed
w78e58.menu.optimize.none=None
w78e58.menu.optimize.none.build.nb_optimize=none

w78e58.menu.compiler.auto=Auto-detect SDCC (default)
w78e58.menu.compiler.auto.build.nb_compiler=auto
w78e58.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
w78e58.menu.compiler.configured.build.nb_compiler=configured

w78e58.menu.fcpu.board=As the board says (default)
w78e58.menu.fcpu.board.build.nb_fcpu=board
w78e58.menu.fcpu.4000000=4 MHz
w78e58.menu.fcpu.4000000.build.nb_fcpu=4000000
w78e58.menu.fcpu.8000000=8 MHz
w78e58.menu.fcpu.8000000.build.nb_fcpu=8000000
w78e58.menu.fcpu.11059200=11.0592 MHz
w78e58.menu.fcpu.11059200.build.nb_fcpu=11059200
w78e58.menu.fcpu.12000000=12 MHz
w78e58.menu.fcpu.12000000.build.nb_fcpu=12000000
w78e58.menu.fcpu.16000000=16 MHz
w78e58.menu.fcpu.16000000.build.nb_fcpu=16000000
w78e58.menu.fcpu.20000000=20 MHz
w78e58.menu.fcpu.20000000.build.nb_fcpu=20000000
w78e58.menu.fcpu.22118400=22.1184 MHz
w78e58.menu.fcpu.22118400.build.nb_fcpu=22118400
w78e58.menu.fcpu.24000000=24 MHz
w78e58.menu.fcpu.24000000.build.nb_fcpu=24000000
